## Handling Categorical Feature

In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv('titanic.csv',usecols=['Sex'])

In [3]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

# One Hot Encoding

In [4]:
pd.get_dummies(df).head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [5]:
pd.get_dummies(df,drop_first=True).head()
# In One hot encoding we have to drop one column so we ll use drop_first=True.

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [6]:
df1=pd.read_csv('titanic.csv',usecols=['Embarked'])

In [7]:
df1.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [8]:
df1['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [9]:
pd.get_dummies(df1).head() 
#drop_first = False

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [10]:
pd.get_dummies(df1,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

# Disadvantage 
#### It creates more columns 
#### Curse of Dimensionality

## One Hot encoding with many categories in Feature

In [11]:
data=pd.read_csv('mercedes.csv',usecols=['X0','X1','X2','X3','X4','X5','X6'])

In [12]:
data.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [13]:
for i in data.columns:
    print(len(data[i].unique()))

47
27
44
7
4
29
12

In [14]:
# Taking 10 most Frequent Category
data['X1'].value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [15]:
list_10=data['X1'].value_counts().sort_values(ascending=False).head(10).index

In [16]:
list_10=list(list_10)
list_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [17]:
for categories in list_10:
    data[categories]=np.where(data['X1']==categories,1,0)

In [18]:
list_10.append('X1')

In [19]:
data[list_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]

# Ordinal Categories

#### When you can Assign Grades or Ratings, Order number etc comes under Ordinal categories

In [20]:
import datetime

In [21]:
today_date=datetime.datetime.today()

In [22]:
datetime.timedelta(1)

datetime.timedelta(days=1)

In [23]:
today_date-datetime.timedelta(2) # we are substracting 2 days from today's date

datetime.datetime(2020, 8, 11, 15, 33, 23, 882166)

In [24]:
## List comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [25]:
df2=pd.DataFrame(days)

In [26]:
df2.columns=['Day']

In [27]:
df2=pd.DataFrame(df2['Day'])

In [28]:
df2["Day"].dt.month # months

0     8
1     8
2     8
3     8
4     8
5     8
6     8
7     8
8     8
9     8
10    8
11    8
12    8
13    7
14    7
Name: Day, dtype: int64

In [29]:
df2["Day"].dt.weekday # Weekdays

0     3
1     2
2     1
3     0
4     6
5     5
6     4
7     3
8     2
9     1
10    0
11    6
12    5
13    4
14    3
Name: Day, dtype: int64

In [30]:
df2.Day.dt.day # days

0     13
1     12
2     11
3     10
4      9
5      8
6      7
7      6
8      5
9      4
10     3
11     2
12     1
13    31
14    30
Name: Day, dtype: int64

In [31]:
df2.Day.dt.minute

0     33
1     33
2     33
3     33
4     33
5     33
6     33
7     33
8     33
9     33
10    33
11    33
12    33
13    33
14    33
Name: Day, dtype: int64

In [32]:
df2['weekday']=df2['Day'].dt.weekday

In [33]:
df2.head()

                         Day  weekday
0 2020-08-13 15:33:23.882166        3
1 2020-08-12 15:33:23.882166        2
2 2020-08-11 15:33:23.882166        1
3 2020-08-10 15:33:23.882166        0
4 2020-08-09 15:33:23.882166        6

In [34]:
dictionary=dict(zip([1,2,3,4,5,6,0],['Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday']))

In [35]:
dictionary

{1: 'Monday',
 2: 'Tuesday',
 3: 'Wednesday',
 4: 'Thursday',
 5: 'Friday',
 6: 'Saturday',
 0: 'Sunday'}

In [36]:
df2['weekday_name']=df2['weekday'].map(dictionary)

In [37]:
df2.head()

                         Day  weekday weekday_name
0 2020-08-13 15:33:23.882166        3    Wednesday
1 2020-08-12 15:33:23.882166        2      Tuesday
2 2020-08-11 15:33:23.882166        1       Monday
3 2020-08-10 15:33:23.882166        0       Sunday
4 2020-08-09 15:33:23.882166        6     Saturday


### count or frequency encoding

In [38]:
train_set=pd.read_csv('adult.data.csv',header=None,index_col=None)

In [39]:
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [40]:
train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       32561 non-null  int64
 1   1       32561 non-null  object
 2   2       32561 non-null  int64
 3   3       32561 non-null  object
 4   4       32561 non-null  int64
 5   5       32561 non-null  object
 6   6       32561 non-null  object
 7   7       32561 non-null  object
 8   8       32561 non-null  object
 9   9       32561 non-null  object
 10  10      32561 non-null  int64
 11  11      32561 non-null  int64
 12  12      32561 non-null  int64
 13  13      32561 non-null  object
 14  14      32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [41]:
len(train_set[1].unique()) # Unique categories in feature 1

9

In [42]:
columns=[1,3,5,6,7,8,9,13]

In [43]:
train_set=train_set[columns]

In [44]:
train_set.columns=(['Employment','Degree','Marital_status','Designataion','Family_resp','Race','Gender','Country'])

In [45]:
train_set.head()

,Employment,Degree,Marital_status,Designataion,Family_resp,Race,Gender,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [46]:
train_set.columns

Index(['Employment', 'Degree', 'Marital_status', 'Designataion', 'Family_resp',
       'Race', 'Gender', 'Country'],
      dtype='object')

In [47]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Marital_status : 7 labels
Designataion : 15 labels
Family_resp : 6 labels
Race : 5 labels
Gender : 2 labels
Country : 42 labels

#### In Count of frequency Encoding we will replace the Categorical value with the output

In [48]:
country_map=train_set['Country'].value_counts().to_dict()

In [49]:
train_set['Country']=train_set['Country'].map(country_map)

In [50]:
train_set.head(20)

,Employment,Degree,Marital_status,Designataion,Family_resp,Race,Gender,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

#### Advantages 
1.Easy to implement
2. Not increasing feature space

#### Disadvantages
1 It will provide same weight if the frequencies are same

### Taget Guided Ordinal Encoding
1. Ordering the labels according to the target


2. Replace the labels with joint probability of being 1 or 0

In [51]:
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])

In [52]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [53]:
df['Cabin'].fillna('Missing',inplace=True)

In [54]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [55]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [56]:
df.head(10)

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing
5         0  Missing
6         0      E46
7         0  Missing
8         1  Missing
9         1  Missing

In [57]:
df['Cabin'].astype(str).str[0]

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [58]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [59]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [60]:

df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [62]:
# Mean Imputation
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [71]:
# sort Values according to Surived and Checking index
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [74]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [75]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [77]:
enumerate(ordinal_labels,0)

In [83]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)} 
# It will help to give rank based on value and index and storing in Dict

In [84]:
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [86]:
df['Cabin']=df['Cabin'].map(ordinal_labels2)

In [89]:
df.head() 
# Encoding based on Target Variable we have calculated mean of survived grouped by cabin and ranked cabin according to mean

   Survived  Cabin
0         0      1
1         1      4
2         1      1
3         1      4
4         0      1